#ifndef __Common_H__ //якщо макрос __Common_H__ не визначений
#define __Common_H__ //визначення __Common_H__ (лише один раз)

#define p 3//макропідстановка p - кількість перерізів трьохвимірної матриці
#define m 50//макропідстановка m - кількість рядків в одному перерізі трьохвимірної матриці
#define n 100//макропідстановка n - кількість стовпців в одному перерізі трьохвимірної матриці
#define n1 m*n //макропідстановка n1- кількість елементів в одновимірному векторі

extern int matr[p][m][n]; //оголошуємо тривимірну матрицю як extern для можливості доступу до неї з інших функцій
extern int vect[n1]; //оголошуємо вектор як extern для можливості доступу до нього з інших функцій
extern int i,j,k; //оголошуємо спільні змінні як extern для можливості використання їх в інших модулях

#endif//завершення, якщо макрос __Common_H__ визначений
