#include "Input.h" //Підключаємо заголовочний файл модуля введення (Input) для доступу до функцій даного модуля (функції введення впорядкованих елементів, введення випадкових елементів, введення обернено впорядкованих елементів)
#include "common.h" //Підключаємо заголовочний файл модуля комон (common) для доступу до спільних даних окремих модулів, що знаходяться в цьому модулі (матриці, вектора, змінних)

void input_sorted() //Безтипова функція введення впорядкованих елементів в матрицю і вектор
{
	int lich=0; //початкова установка лічильника, значення якого на кожному кроці буде записане як елемент
	for(k=0;k<p;k++)
	{
		for(i=0;i<m;i++)
		{
			for(j=0;j<n;j++)
			{
				matr[k][i][j]=lich; //записуємо чергове значення лічильника у поточну комірку матриці
				lich=lich+1; //збільшуємо лічильник
			}
		}
	}
	for(i=0;i<n1;i++) //поточний індекс циклу буде записаний в чергову комірку вектора
	{
		vect[i]=i; //записуємо поточний індекс циклу в чергову комірку вектора
	}
}

void input_back_sorted() //Безтипова функція введення обернено впорядкованих елементів в матрицю і вектор
{
	int lich=p*n1; //початкова установка лічильника, значення якого на кожному кроці буде записане як елемент
	for(k=0;k<p;k++)
	{
		for(i=0;i<m;i++)
		{
			for(j=0;j<n;j++)
			{
				matr[k][i][j]=lich; //записуємо чергове значення лічильника у поточну комірку матриці
				lich--; //зменшуємо лічильник
			}
		}
	}
	
	for(i=0;i<n1;i++) //кількість елементів вектора мінус поточний індекс циклу буде записано в чергову комірку вектора
	{
		vect[i]=n1-i; //записуємо кількість елементів вектора мінус поточний індекс циклу в чергову комірку вектора	
	}
}

void input_random() //Безтипова функція введення випадкових елементів в матрицю і вектор
{
	srand(time(NULL)); //для генерування программою випадкових чисел
	for(k=0;k<p;k++)
	{
		for(i=0;i<m;i++)
		{
			for(j=0;j<n;j++)
			{
				matr[k][i][j]=0+rand()%1600; //запис випадково згенерованого числа в діапазоні від 0 до 1600 в чергову комірку матриці
			}
		}
	}
	for(i=0;i<n1;i++)
	{
		vect[i]=0+rand()%1600; //запис випадково згенерованого числа в діапазоні від 0 до 1600 в чергову комірку вектора
	}
}

