#include "Menu.h" //Підключаємо заголовочний файл модуля меню для доступу до функцій даного модуля (функції меню)
#include "Input.h" //Підключаємо заголовочний файл модуля заповнення (Input) для доступу до функцій даного модуля (функцій введення впорядкованих, не впорядкованих, випадкових матриці та вектора)
#include "Output.h" //Підключаємо заголовочний файл модуля виводу (Output) для доступу до функцій даного модуля (функцій виведення матриці та вектора; виведення таблиці результатів)
#include "sortings.h" //Підключаємо заголовочний файл модуля сортування (sortings) для доступу до функцій даного модуля (функцій сортування вставкою матриці, ветора; вибором матриці, вектора; обміном матриці, вектора)

void menu() //Безтипова функція меню
{
	int par,o=0,par1; //змінні par і par1 типу int - для обрання запропонованих функцією меню пунктів; змінна о типу int - для можливості перевірки правильності роботи алгоритмів сортування
	while (o==0) //цикл буде повторюватися доти, доки не буде викликана функція побудови таблиці швидкодії алгоритмів сортування або користувач не захоче вийти при запиті на повторення циклу 
	{
		printf("\t Input 1 to Input Ordered Matrix And Sort with Insertion \n");
		printf("\t Input 2 to Input Random Ordered Matrix And Sort with Insertion \n");
		printf("\t Input 3 to Input Back Ordered Matrix And Sort with Insertion \n");
		printf("\t Input 4 to Input Ordered Matrix And Sort with Selection \n");
		printf("\t Input 5 to Input Random Ordered Matrix And Sort with Selection \n");
		printf("\t Input 6 to Input Back Ordered Matrix And Sort with Selection \n");
		printf("\t Input 7 to Input Ordered Matrix And Sort with Exchange with a Flag \n");
		printf("\t Input 8 to Input Random Ordered Matrix And Sort with Exchange with a Flag \n");
		printf("\t Input 9 to Input Back Ordered Matrix And Sort with Exchange with a Flag \n");
		printf("\t Input 0 to Show all of the Results of the time of Sorting \n");
		scanf("%d",&par); //обирання користувачем одного із пунктів меню
		printf("\n");
		system("cls"); //очищення екрану від попередніх виводів
		if((par<0)||(par>9)) //перевірка на правильність вибору одного з пунктів меню
		{
			printf(" Error Input. Try Again\n "); //вивід при помилці вибору одного з пунктів меню
		}
		else
		{
			switch (par) //конструкція перемикання із набором констант - можливих значень вибору користувача
			{
				case 1:{
							input_sorted(); //виклик функції заповнення матриці та вектора відсортованими за незменшенням елементами
							output(1,1,1); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							insertion_sort(); //виклик функції сортування матриці методом вставки
							insertion_vect(); //виклик функції сортування вектора методом вставки
							output(2,1,1); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			  		   	}
				case 2:{
							input_random(); //виклик функції заповнення матриці та вектора випадковими елементами
							output(1,1,2); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							insertion_sort(); //виклик функції сортування матриці методом вставки
							insertion_vect(); //виклик функції сортування вектора методом вставки
							output(2,1,2);  //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			 	       }
				case 3:{
							input_back_sorted(); //виклик функції заповнення матриці та вектора обернено відсортованими за незменшенням елементами
							output(1,1,3); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							insertion_sort(); //виклик функції сортування матриці методом вставки
							insertion_vect(); //виклик функції сортування вектора методом вставки 
							output(2,1,3); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			 		   }
				case 4:{
							input_sorted(); //виклик функції заповнення матриці та вектора відсортованими за незменшенням елементами
							output(1,2,1); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							selection_sort(); //виклик функції сортування матриці методом вибору
							selection_vect(); //виклик функції сортування вектора методом вибору
							output(2,2,1); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			   		   }
				case 5:{
							input_random(); //виклик функції заповнення матриці та вектора випадковими елементами
							output(1,2,2); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							selection_sort(); //виклик функції сортування матриці методом вибору
							selection_vect(); //виклик функції сортування вектора методом вибору
							output(2,2,2); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			   		   }
				case 6:{
							input_back_sorted(); //виклик функції заповнення матриці та вектора обернено відсортованими за незменшенням елементами
							output(1,2,3); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							selection_sort(); //виклик функції сортування матриці методом вибору
							selection_vect(); //виклик функції сортування вектора методом вибору
							output(2,2,3); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
					   }
				case 7:{
							input_sorted(); //виклик функції заповнення матриці та вектора відсортованими за незменшенням елементами
							output(1,3,1); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							exchange_flag_sort(); //виклик функції сортування матриці методом обміну з прапорцем
							exchange_flag_vect(); //виклик функції сортування вектора методом обміну з прапорцем
							output(2,3,1); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			  		   }
				case 8:{
							input_random();//виклик функції заповнення матриці та вектора випадковими елементами
							output(1,3,2); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							exchange_flag_sort(); //виклик функції сортування матриці методом обміну з прапорцем
							exchange_flag_vect(); //виклик функції сортування вектора методом обміну з прапорцем
							output(2,3,2); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			  		   }
				case 9:{
							input_back_sorted(); //виклик функції заповнення матриці та вектора обернено відсортованими за незменшенням елементами
							output(1,3,3); //виклик функції виводу початкової матриці та початкового вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							exchange_flag_sort(); //виклик функції сортування матриці методом обміну з прапорцем
							exchange_flag_vect(); //виклик функції сортування вектора методом обміну з прапорцем
							output(2,3,3); //виклик функції виводу відсортованих матриці та вектора (1 параметр - сортовані/несортовані матриця і вектор 2 - тип сортування матриці і вектора, 3 - тип введення матриці та вектора)
							break;
			  		   }
				case 0:{
							o=1; //умова завершення циклу
							ouput_table(); //виклик функції виводу таблиці швидкодії алгоритмів сортування
							break;
				   	   }
			} 
			if(par!=0) //якщо не обрано вивід таблиці швидкодії алгоритмів сортування
			{
				printf("Would You like to Sort again?\n"); //запит про повторну перевірку правильності роботи алгоритмів сортування
				printf(" \t Press 1 to do");
				printf(" \t Press 2 to exit\n\n");
				scanf("%d",&par1); //обирання користувачем одного із пунктів
				system("cls"); //очищення екрану від попередніх виводів
				if(par1!=1) //якщо користувач обрав вихід
				{
					o=1; //умова завершення циклу
					ouput_table(); //виклик функції виводу таблиці швидкодії алгоритмів сортування
				}		
			}
		}
	}
}

